Extensions/ИнтеграцияGreenApi/Catalogs/iga_ШаблоныСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>iga_ШаблоныСообщений</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Утвержден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяКнопки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_КатегорииШаблонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>180</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ЯзыкиЧатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_СтатусыПодтвержденияШаблонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенДляВыбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСодержимого</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_ТипыСодержимогоШаблона</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаИзображение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециальнаяМетка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_СпециальныеМетки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПодготовки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверочныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеОтправки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверочныйКодПослеОтправки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Кнопки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.iga_ТипыКнопокСообщения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПримера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрКнопки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.iga_ПодразделенияОператоров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыШаблона</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеИсточник</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПримера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Enums/iga_СтатусыПодтвержденияШаблонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>iga_СтатусыПодтвержденияШаблонов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПроверке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаШаблона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приостановлен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Enums/iga_ТипыСодержимогоШаблона.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>iga_ТипыСодержимогоШаблона</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Текст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изображение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Enums/iga_КатегорииШаблонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>iga_КатегорииШаблонов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Маркетинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утилита</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Enums/iga_ТипыКнопокСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>iga_ТипыКнопокСообщения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПереходПоСсылке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ответ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерТелефона</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Catalogs/iga_ШаблоныСообщений/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ОбновитьСписокШаблоновНаСервере()
	
	Бот = Обработки.iga_ChatBot.Создать();
	Бот.ИнициализацияОсновныхПараметров();
	МассивШаблонов = Бот.ПолучитьСписокШаблонов();
	
	Идентификаторы = Новый Массив;
	
	Для Каждого СтруктураШаблона Из МассивШаблонов.templates Цикл
		Если Не СтруктураШаблона.category = "MARKETING"
			И Не СтруктураШаблона.category = "UTILITY" Тогда
			Продолжить;
		КонецЕсли;
		Идентификаторы.Добавить(СтруктураШаблона.templateId);
	КонецЦикла;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ШаблоныСообщений.Ссылка КАК Ссылка,
	               |	iga_ШаблоныСообщений.Идентификатор КАК Идентификатор
	               |ИЗ
	               |	Справочник.iga_ШаблоныСообщений КАК iga_ШаблоныСообщений
	               |ГДЕ
	               |	iga_ШаблоныСообщений.Идентификатор В(&Идентификаторы)";
	Запрос.УстановитьПараметр("Идентификаторы", Идентификаторы);
	Выборка = Запрос.Выполнить().Выбрать();
	
	СуществующиеШаблоны = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		СуществующиеШаблоны.Вставить(Выборка.Идентификатор, Выборка.Ссылка);
	КонецЦикла;
	
	Для Каждого Шаблон Из МассивШаблонов.templates Цикл
		
		СсылкаШаблон = СуществующиеШаблоны.Получить(Шаблон.templateId);
		
		Если Не СсылкаШаблон = Неопределено Тогда
			СуществующиеШаблоны.Удалить(Шаблон.templateId);
			СправочникШаблон = СсылкаШаблон.ПолучитьОбъект();
		Иначе
			СправочникШаблон = Справочники.iga_ШаблоныСообщений.СоздатьЭлемент();
			СправочникШаблон.Наименование = ?(Шаблон.Свойство("vertical"), Шаблон.vertical, Шаблон.elementName);
			СправочникШаблон.Идентификатор = Шаблон.templateId;
		КонецЕсли;                        
		СправочникШаблон.Статус = Перечисления.iga_СтатусыПодтвержденияШаблонов.ПолучитьПеречислениеПоСтатусу(Шаблон.status);
		СправочникШаблон.ИмяШаблона = Шаблон.elementName;
		
		НайденныйЯзык = Справочники.iga_ЯзыкиЧатов.НайтиПоРеквизиту("КодЯзыка", Шаблон.languageCode);
		
		Если НайденныйЯзык.Пустая() Тогда
			ЯзыкОбъект = Справочники.iga_ЯзыкиЧатов.СоздатьЭлемент();
			ЯзыкОбъект.Наименование = Шаблон.languageCode;
			ЯзыкОбъект.КодЯзыка = Шаблон.languageCode;
			ЯзыкОбъект.Записать();
			НайденныйЯзык = ЯзыкОбъект.Ссылка;
		КонецЕсли;
		
		СправочникШаблон.Язык = НайденныйЯзык;
		Если Шаблон.Свойство("vertical") Тогда
			СправочникШаблон.КраткоеОписание = Шаблон.vertical;
		Иначе
			СправочникШаблон.КраткоеОписание = "Без описания";
		КонецЕсли;
		
		Если Шаблон.templateType = "IMAGE" Тогда
			СправочникШаблон.ТипСодержимого = Перечисления.iga_ТипыСодержимогоШаблона.Изображение;
		Иначе
			СправочникШаблон.ТипСодержимого = Перечисления.iga_ТипыСодержимогоШаблона.Текст;
		КонецЕсли;
		
		containerMeta = ПрочитатьЗначениеJSON(Шаблон.containerMeta);
		
		Если iga_ОбщегоНазначенияКлиентСервер.КоличествоПараметровВТексте(containerMeta.data) = 0
			Или СправочникШаблон.ТекстСообщения = "" Тогда
			СправочникШаблон.ТекстСообщения = containerMeta.data;
		КонецЕсли;
		Если Шаблон.category = "MARKETING" Тогда
			СправочникШаблон.Категория = Перечисления.iga_КатегорииШаблонов.Маркетинг;
		Иначе
			СправочникШаблон.Категория = Перечисления.iga_КатегорииШаблонов.Утилита;
		КонецЕсли;
		Если containerMeta.Свойство("buttons") Тогда
			
			ПараметрыВосстановления = Новый Соответствие;
			
			Для Каждого СтруктураКнопки Из containerMeta.buttons Цикл
				Если СтруктураКнопки.Свойство("example") Тогда
					Если ТипЗнч(СтруктураКнопки.example) = Тип("Строка") Тогда
						НайденнаяСтрока = СправочникШаблон.Кнопки.Найти(СтруктураКнопки.example, "ЗначениеПримера");
						Если Не НайденнаяСтрока = Неопределено Тогда
							ПараметрыВосстановления.Вставить(СтруктураКнопки.example, НайденнаяСтрока.ПараметрКнопки);
						КонецЕсли;
					Иначе
						НайденнаяСтрока = СправочникШаблон.Кнопки.Найти(СтруктураКнопки.example[0], "ЗначениеПримера");
						Если Не НайденнаяСтрока = Неопределено Тогда
							ПараметрыВосстановления.Вставить(СтруктураКнопки.example[0], НайденнаяСтрока.ПараметрКнопки);
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
				
			СправочникШаблон.Кнопки.Очистить();
			Для Каждого СтруктураКнопки Из containerMeta.buttons Цикл
				СтрокаКнопки = СправочникШаблон.Кнопки.Добавить();
				Если СтруктураКнопки.type = "URL" Тогда
					СтрокаКнопки.Тип = Перечисления.iga_ТипыКнопокСообщения.ПереходПоСсылке;
					СтрокаКнопки.Значение = СтруктураКнопки.url;
				ИначеЕсли СтруктураКнопки.type = "QUICK_REPLY" Тогда
					СтрокаКнопки.Тип = Перечисления.iga_ТипыКнопокСообщения.Ответ;
				Иначе
					СтрокаКнопки.Тип = Перечисления.iga_ТипыКнопокСообщения.НомерТелефона;
					СтрокаКнопки.Значение = СтруктураКнопки.phone_number;
				КонецЕсли;
				СтрокаКнопки.Заголовок = СтруктураКнопки.text;
				Если СтруктураКнопки.Свойство("example") Тогда
					Если ТипЗнч(СтруктураКнопки.example) = Тип("Строка") Тогда
						СтрокаКнопки.ЗначениеПримера = СтруктураКнопки.example;
					Иначе
						СтрокаКнопки.ЗначениеПримера = СтруктураКнопки.example[0];
					КонецЕсли;
					ПараметрКнопки = ПараметрыВосстановления.Получить(СтрокаКнопки.ЗначениеПримера);
					Если Не ПараметрКнопки = Неопределено Тогда
						СтрокаКнопки.ПараметрКнопки = ПараметрКнопки;
					Иначе
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = "Шаблон """ + СправочникШаблон.Наименование +""" требует внимания. Есть кнопки с параметрами.";
						Сообщение.Сообщить();
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		СправочникШаблон.Записать();
		
	КонецЦикла;
	
	Для Каждого ЭлементСоответствия Из СуществующиеШаблоны Цикл
		СправочникШаблон = ЭлементСоответствия.Значение.ПолучитьОбъект();
		СправочникШаблон.Статус = Перечисления.iga_СтатусыПодтвержденияШаблонов.Создан;
		СправочникШаблон.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокШаблонов(Команда)
	
	ОбновитьСписокШаблоновНаСервере();
	Элементы.Список.Обновить();
	ПоказатьПредупреждение(, "Шаблоны успешно обновлены!", 60, "Обновление шаблонов");
	
КонецПроцедуры
